package com.zgy.goldmonitor.bean;

public class Info {

	public static final String[] names_inner = { "名称：", "未知：", "今开：", "最高：", "最低：", "昨收：", "买入价：", "卖出价：", "最新价：", "动态结算：", "昨日结算：", "买量：", "卖量：", "持仓量：", "成交量：", "交易所：", "产品：", "日期：" };
	public static final String[] names_outer = { "最新价： ", "涨跌幅：", "买入价：", "卖出价：", "最高价：", "最低价：", "行情时间：", "昨日结算价：", "开盘价：", "持仓量：", "买量：", "卖量：", "行情日期：", "名称：" };


	public String[] values;
	public String[] names;
 


}
// 18879.00, -2.2826 ,18864.00,18877.00,19350.00, 18830.00,16:28:59,19320.00,19290.00,827,0,0,2014-05-29,LME镍
//
// 名称 最新价 人民币报价 涨跌额 涨跌幅 开盘价 最高价 最低价 昨日结算价 持仓量 买价 卖价 行情时间
// LME镍3个月 18879.00 117791.74 -441.00 -2.28% 19290.00 19350.00 18830.00 19320.00 827 18865.00 18877.00 16:30:08


// 0：豆粕连续，名字
// 1：145958，不明数字（难道是数据提供商代码？）
// 2：3170，开盘价
// 3：3190，最高价
// 4：3145，最低价
// 5：3178，昨日收盘价 （2013年6月27日）
// 6：3153，买价，即“买一”报价
// 7：3154，卖价，即“卖一”报价
// 8：3154，最新价，即收盘价
// 9：3162，结算价
// 10：3169，昨结算
// 11：1325，买 量
// 12：223，卖 量
// 13：1371608，持仓量
// 14：1611074，成交量
// 15：连，大连商品交易所简称
// 16：豆粕，品种名简称